Repository: RockxyApp/Rockxy
Catalog: Rockxy/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: %@'s recognized proxy settings were prepared temporarily and will be restored after it quits. A fresh instance was opened with Rockxy's scoped environment.
zh_hans: 已临时准备 %@ 的已识别代理设置，并将在该应用退出后恢复。已使用 Rockxy 的作用域环境打开新实例。

source: %@ was opened with temporary proxy settings. Keep Rockxy open until the application quits so those settings can be restored safely.
zh_hans: 已使用临时代理设置打开 %@。请保持 Rockxy 运行，直到该应用退出，以便安全恢复这些设置。

source: %@ was opened with an explicit scoped proxy and Rockxy's environment. These launch settings remain active until the application quits.
zh_hans: 已使用显式作用域代理和 Rockxy 环境打开 %@。这些启动设置会持续生效，直到该应用退出。

source: %@ was opened with Rockxy's scoped environment. If it overrides macOS or environment proxy settings, configure that app-level proxy separately.
zh_hans: 已使用 Rockxy 的作用域环境打开 %@。如果它会覆盖 macOS 或环境代理设置，请单独配置该应用级代理。

source: Choose & Open Developer App…
zh_hans: 选择并打开开发者应用…

source: Choose a developer application
zh_hans: 选择开发者应用

source: Choose a fully quit developer application to open with Rockxy's scoped proxy and certificate environment. Rockxy also prepares recognized app-level proxy settings to follow the active macOS System Proxy at %@. Containers, emulators, devices, and already-running processes remain separate capture boundaries.
zh_hans: 选择一个已完全退出的开发者应用，使用 Rockxy 的作用域代理和证书环境打开。Rockxy 还会准备已识别的应用级代理设置，使其使用当前的 macOS 系统代理 %@。容器、模拟器、设备和已运行的进程仍是独立的捕获边界。

source: Choose a valid macOS application.
zh_hans: 请选择有效的 macOS 应用程序。

source: Developer application
zh_hans: 开发者应用

source: Enable macOS System Proxy in Rockxy before opening %@.
zh_hans: 请先在 Rockxy 中启用 macOS 系统代理，再打开 %@。

source: Open with Rockxy
zh_hans: 使用 Rockxy 打开

source: Opens a fresh app instance with scoped proxy and certificate settings; recognized app-level proxy settings are prepared safely.
zh_hans: 使用作用域代理和证书设置打开新的应用实例；已识别的应用级代理设置会被安全准备。

source: Quit %@ completely, then try again so its proxy state and launch environment cannot be stale.
zh_hans: 请完全退出 %@ 后重试，避免使用过期的代理状态和启动环境。

source: Start the Rockxy proxy before opening a developer application.
zh_hans: 请先启动 Rockxy 代理，再打开开发者应用。

source: The application's HTTP Proxy settings file is malformed. Rockxy left it unchanged.
zh_hans: 该应用的 HTTP 代理设置文件格式错误。Rockxy 未对其进行更改。

source: The application rewrote its temporary proxy settings into an unreadable form. Rockxy restored the original settings and preserved the unreadable copy at %@. Review it, then try again.
zh_hans: 应用将临时代理设置改写成了无法读取的格式。Rockxy 已恢复原始设置，并将无法读取的副本保存在 %@。请检查该副本后重试。

source: The selected application's proxy metadata could not be read safely.
zh_hans: 无法安全读取所选应用的代理元数据。

source: The selected application reported an unsafe settings location. Rockxy left it unchanged.
zh_hans: 所选应用报告了不安全的设置位置。Rockxy 未对其进行更改。

source: open the developer application
zh_hans: 打开开发者应用

source: One or more clients rejected the Rockxy certificate for multiple HTTPS hosts. The macOS Root CA is trusted, so the affected client may use a separate trust store or certificate pinning. Restart or configure that client before retrying interception.
zh_hans: 一个或多个客户端在多个 HTTPS 主机上拒绝了 Rockxy 证书。macOS Root CA 已受信任，因此受影响的客户端可能使用独立的信任存储或证书固定。请重新启动或配置该客户端后再重试解密。

source: One or more clients rejected the Rockxy certificate for multiple HTTPS hosts. Check the Rockxy Root CA in Keychain Access and any client-specific trust store, then restart the affected client.
zh_hans: 一个或多个客户端在多个 HTTPS 主机上拒绝了 Rockxy 证书。请检查“钥匙串访问”中的 Rockxy Root CA 以及客户端专用信任存储，然后重新启动受影响的客户端。

source: Added host Decrypt rules for domains observed from %@. These rules apply to every application.
zh_hans: 已为从 %@ 观察到的域名添加主机解密规则。这些规则适用于所有应用程序。

source: Configured %lld of %lld observed hosts. Review Tunnel or bypass rules for the remaining hosts.
zh_hans: 已配置 %lld 个观察主机（共 %lld 个）。请检查其余主机的隧道或绕过规则。

source: Creates host rules that apply to these domains in every application.
zh_hans: 创建适用于每个应用程序中这些域名的主机规则。

source: Decrypt This Host
zh_hans: 解密此主机

source: Review Rules
zh_hans: 检查规则

source: Set domains observed from %@ to Tunnel. These host rules apply to every application.
zh_hans: 已将从 %@ 观察到的域名设为隧道传输。这些主机规则适用于所有应用程序。

source: The host is unavailable.
zh_hans: 主机不可用。

source: This host is in Full Proxy Bypass. Remove that bypass entry before decrypting it.
zh_hans: 此主机位于完整代理绕过列表中。请先移除该绕过条目，再进行解密。

source: This host is in the HTTPS TLS Bypass list. Remove that bypass pattern before decrypting it.
zh_hans: 此主机位于 HTTPS TLS 绕过列表中。请先移除该绕过模式，再进行解密。

source: Tunnel rule %@ takes priority. Review that broader rule before decrypting this host.
zh_hans: 隧道规则 %@ 优先。解密此主机前，请检查该范围更广的规则。

source: Tunnel This Host
zh_hans: 隧道传输此主机

source: A rule with this application and behavior already exists.
zh_hans: 已存在具有此应用和行为的规则。

source: Add an application, host pattern, or observed hosts to decrypt HTTPS.
zh_hans: 添加应用、主机模式或已观察主机以解密 HTTPS。

source: Add Application
zh_hans: 添加应用

source: Add Application…
zh_hans: 添加应用…

source: Add Observed Hosts…
zh_hans: 添加已观察主机…

source: Applies to new connections after the app reconnects.
zh_hans: 应用重新连接后，此规则将应用于新连接。

source: Capture new traffic from a local app, then return here.
zh_hans: 从本地应用捕获新流量，然后返回此处。

source: Choose an application, host pattern, or observed hosts.
zh_hans: 选择应用、主机模式或已观察主机。

source: Choose an observed local app. The rule follows its stable identity across every HTTPS host it uses.
zh_hans: 选择已观察到的本地应用。该规则使用稳定身份，适用于其访问的所有 HTTPS 主机。

source: Choose Behavior
zh_hans: 选择行为

source: Choose Decrypt or Tunnel behavior for new application connections.
zh_hans: 为应用的新连接选择解密或隧道传输行为。

source: Choose how Rockxy handles HTTPS from this application on new connections
zh_hans: 选择 Rockxy 如何处理此应用的新 HTTPS 连接

source: Decrypt All HTTPS
zh_hans: 解密所有 HTTPS

source: Decrypt All HTTPS from This Application
zh_hans: 解密此应用的所有 HTTPS

source: Decrypt Observed Hosts
zh_hans: 解密已观察主机

source: Decrypt Only This Host
zh_hans: 仅解密此主机

source: Decrypting an entire app can expose sensitive traffic and use more CPU and memory. Add Tunnel rules for exceptions.
zh_hans: 解密整个应用可能暴露敏感流量并使用更多 CPU 和内存。可添加隧道规则作为例外。

source: decrypt
zh_hans: 解密

source: Edit Application Rule
zh_hans: 编辑应用规则

source: HTTPS Behavior
zh_hans: HTTPS 行为

source: No Local Applications Observed
zh_hans: 尚未观察到本地应用

source: No Matching Applications
zh_hans: 没有匹配的应用

source: Remove Application Rule
zh_hans: 移除应用规则

source: Rules decide which apps and hosts Rockxy decrypts. Other connections remain opaque TLS tunnels.
zh_hans: 规则决定 Rockxy 解密哪些应用和主机。其他连接仍为不透明的 TLS 隧道。

source: Search applications
zh_hans: 搜索应用

# Set %@ to decrypt HTTPS. %@ stays tunneled: %@
source: Set %1$@ to decrypt HTTPS. %2$@ stays tunneled: %3$@
zh_hans: 已将 %1$@ 设为解密 HTTPS。但 %2$@ 仍以隧道传输：%3$@

source: Set %1$@ to decrypt HTTPS. Matching tunneled connections reset automatically — if one stays tunneled, reconnect the app.
zh_hans: 已将 %1$@ 设为解密 HTTPS。匹配的实时连接将自动重置——如仍以隧道传输，请重新连接应用。

source: Tunnel rule %@ takes priority. Change that host behavior before decrypting it.
zh_hans: 隧道规则 %@ 优先。请先更改该主机行为，再进行解密。

# Set %@ to tunnel HTTPS on new connections. Reconnect the app.
source: Set %1$@ to tunnel HTTPS on new connections. Reconnect the app.
zh_hans: 已将 %1$@ 的新 HTTPS 连接设为隧道传输。请重新连接应用。

source: Target
zh_hans: 目标

source: This target has both behaviors. Tunnel Without Decryption takes priority.
zh_hans: 此目标同时具有两种行为。不解密隧道优先。

source: The application Tunnel rule takes priority. Change the application behavior first.
zh_hans: 应用隧道规则优先。请先更改应用行为。

source: Try a different app, host, scope, or behavior.
zh_hans: 请尝试其他应用、主机、范围或行为。

source: Try a different app, identifier, or host.
zh_hans: 请尝试其他应用、标识符或主机。

source: Tunnel All HTTPS
zh_hans: 隧道传输所有 HTTPS

source: Tunnel All HTTPS from This Application
zh_hans: 隧道传输此应用的所有 HTTPS

source: Tunnel App
zh_hans: 隧道传输应用

source: tunnel
zh_hans: 隧道传输

source: • %lld evicted
zh_hans: • 已淘汰 %lld 项

source: // %lld items
zh_hans: // %lld 项

source: for the host pattern %@
zh_hans: 对应主机模式 %@

# "%@" could not be read. %@
source: "%1$@" could not be read. %2$@
zh_hans: 无法读取“%1$@”。 %2$@

source: “%@” has unsaved changes. Save them before switching scripts?
zh_hans: “%@”有未保存的更改。切换脚本前要保存吗？

source: “%@” will be removed from disk. This cannot be undone.
zh_hans: “%@”将从磁盘中移除。此操作无法撤销。

source: “%@” will be removed from the template library.
zh_hans: “%@”将从模板库中移除。

source: “%@” will be removed. Scripts inside it are kept and moved to the top level.
zh_hans: 将移除“%@”。其中的脚本会被保留并移动到顶层。

source: (binary data, %lld bytes)
zh_hans: （二进制数据，%lld 字节）

source: (Copy)
zh_hans: （副本）

source: (empty payload)
zh_hans: （空有效载荷）

source: (no headers)
zh_hans: （无标头）

source: (no query parameters)
zh_hans: （无查询参数）

source: %@ Rockxy re-registered the helper from the current app bundle. macOS still needs you to approve it in System Settings > Login Items.
zh_hans: %@ Rockxy 已从当前 App 包中重新注册辅助工具。你仍需在系统设置 > 登录项中批准它。

source: %@ Rockxy reinstalled the helper from the current app bundle and verified that it is reachable.
zh_hans: %@ Rockxy 已从当前应用程序包重新安装辅助工具，并验证其可访问。

source: %@ Rockxy reinstalled the helper, but its protocol version is not compatible with this app build.
zh_hans: %@ Rockxy 已重新安装辅助工具，但其协议版本与此 App 构建不兼容。

source: %@ Rockxy reinstalled the helper, but macOS has not made the XPC service reachable yet.
zh_hans: %@ Rockxy 已重新安装辅助工具，但 macOS 尚未使 XPC 服务可访问。

source: %@ Rockxy reinstalled the helper, but the app and helper signing identities still do not match.
zh_hans: %@ Rockxy 已重新安装辅助工具，但应用和辅助工具的签名身份仍不匹配。

source: %@ Rockxy reinstalled the helper, but the installed helper still appears older than this app build.
zh_hans: %@ Rockxy 已重新安装辅助工具，但安装的辅助工具看起来仍旧早于此 App 构建。

source: %@ Rockxy removed stale helper state, but the helper is not installed.
zh_hans: %@ Rockxy 已移除过时的辅助工具状态，但辅助工具尚未安装。

source: %@ — Unavailable
zh_hans: %@ — 不可用

# %@ · %@ · %lld requests
source: %1$@ · %2$@ · %3$lld requests
zh_hans: %1$@ · %2$@ · %3$lld 个请求

# %@ %@ preview
source: %1$@ %2$@ preview
zh_hans: %1$@ %2$@ 预览

# %@ and paths under %@
source: %1$@ and paths under %2$@
zh_hans: %1$@ 和 %2$@ 下的路径

source: %1$@ contains %2$lld traffic tab(s), user-authored filter text, host/path patterns, and layout preferences. It contains no captured traffic, bodies, headers, cookies, scripts, or local file paths. Filter text may be sensitive. Existing Projects will not be replaced.
zh_hans: %1$@ 包含 %2$lld 个流量标签页、用户编写的过滤文本、主机/路径模式和布局偏好设置。其中不包含捕获的流量、正文、标头、Cookie、脚本或本地文件路径。过滤文本可能包含敏感信息。现有项目不会被替换。

source: %@ context
zh_hans: %@ 上下文

# %@ exited with status %d: %@
source: %1$@ exited with status %2$d: %3$@
zh_hans: %1$@ 退出，状态为 %2$d：%3$@

# %@ exited with status %d.
source: %1$@ exited with status %2$d.
zh_hans: %1$@ 已退出，状态为 %2$d。

# %@ finding: %@
source: %1$@ finding: %2$@
zh_hans: %1$@ 发现：%2$@

source: %@ input
zh_hans: %@ 输入

# %@ is %@, which is larger than the 10 MB per-file limit.
source: %1$@ is %2$@, which is larger than the 10 MB per-file limit.
zh_hans: %1$@ 为 %2$@，超过每个文件 10 MB 的上限。

source: %@ is not available on this Mac.
zh_hans: %@ 在这台 Mac 上不可用。

source: %@ is not available.
zh_hans: %@ 不可用。

source: %@ is ready and selected globally.
zh_hans: %@ 已就绪并被选为全局选项。

source: %@ manual setup
zh_hans: %@ 手动设置

# %@ of %lld stored
source: %1$@ of %2$lld stored
zh_hans: 已存储 %2$lld 个中的 %1$@ 个

# %@ on %@
source: %1$@ on %2$@
zh_hans: %1$@，位于 %2$@

source: %@ output
zh_hans: %@ 输出

source: %@ reference this schema. Deleting it clears their schema selection.
zh_hans: %@ 引用了此架构。删除它会清除其架构选择。

source: %@ rules • ⌘N New • ⌘↩ Edit • ⌘D Duplicate • ⌘⌫ Delete
zh_hans: %@ 条规则 • ⌘N 新建 • ⌘↩ 编辑 • ⌘D 复制 • ⌘⌫ 删除

source: %@ scripts • ⌘N New • ⌘↩ Edit • ⇧⌘N Folder
zh_hans: %@ 个脚本 • ⌘N 新建 • ⌘↩ 编辑 • ⇧⌘N 文件夹

source: %@ selected and opted-in related request(s)
zh_hans: %@ 个选定并已加入的相关请求

source: %@ selected request(s)
zh_hans: 已选择 %@ 个请求

source: %@ shortened to Rockxy's in-memory safety limits.
zh_hans: %@ 已缩短至 Rockxy 的内存安全限制。

source: %@ snippet copied.
zh_hans: 已复制 %@ 代码片段。

source: %@ terminal session
zh_hans: %@ 终端会话

source: %@ tokens
zh_hans: %@ 个 token

source: %@ total
zh_hans: 共 %@

# %@, %@ +%lld more
source: %1$@, %2$@ +%3$lld more
zh_hans: %1$@、%2$@，另有 %3$lld 项

# %@, %lld active rules
source: %1$@, %2$lld active rules
zh_hans: %1$@，%2$lld 条生效规则

source: %@, Active Project
zh_hans: %@，当前项目

source: %@, excluding models
zh_hans: %@，不含模型

# %@, out of %lld retained in this session.
source: %1$@, out of %2$lld retained in this session.
zh_hans: %1$@，本会话中保留了 %2$lld 个。

# %@. Hide %@.
source: %1$@. Hide %2$@.
zh_hans: %1$@。隐藏 %2$@。

# %@… [line limited to %lld of %lld characters · SHA-256 %@]
source: %1$@… [line limited to %2$lld of %3$lld characters · SHA-256 %4$@]
zh_hans: %1$@… [行限制为 %2$lld/%3$lld 个字符 · SHA-256 %4$@]

source: %lld ACTIVE
zh_hans: %lld 个活跃

source: %lld active Breakpoint rules. Open Breakpoint Rules.
zh_hans: 有 %lld 条生效的断点规则。打开断点规则。

source: %lld active Map Local rules. Open Map Local.
zh_hans: %lld 条生效的 Map Local 规则。打开 Map Local。

source: %lld active Map Remote rules. Open Map Remote.
zh_hans: 有 %lld 条生效的 Map Remote 规则。打开 Map Remote。

source: %lld active Modify Header rules
zh_hans: %lld 条生效的修改标头规则

source: %lld active rules
zh_hans: %lld 条生效规则

source: %lld added
zh_hans: 已添加 %lld 个

source: %lld already exists
zh_hans: %lld 已存在

source: %lld baseline request headers are absent
zh_hans: 缺少 %lld 个基线请求标头

source: %lld batch calls completed
zh_hans: 已完成 %lld 个批量调用

source: %lld calls
zh_hans: %lld 次调用

source: %lld captured
zh_hans: 已捕获 %lld 个

source: %lld captured requests
zh_hans: %lld 个已捕获请求

# %lld captured stream events, finish %@
source: %1$lld captured stream events, finish %2$@
zh_hans: 已捕获 %1$lld 个流事件，结束于 %2$@

source: %lld conditions
zh_hans: %lld 个条件

# %lld decrypt · %lld tunnel
source: %1$lld decrypt · %2$lld tunnel
zh_hans: %1$lld 个解密 · %2$lld 个隧道

source: %lld definitions
zh_hans: %lld 个定义

source: %lld Enabled
zh_hans: 已启用 %lld 个

source: %lld errors
zh_hans: %lld 个错误

source: %lld events
zh_hans: %lld 个事件

source: %lld failed or error responses
zh_hans: %lld 个失败或错误响应

source: %lld host patterns
zh_hans: %lld 个主机模式

# %lld included · %lld skipped
source: %1$lld included · %2$lld skipped
zh_hans: 已包含 %1$lld 个 · 已跳过 %2$lld 个

# %lld input · %lld output
source: %1$lld input · %2$lld output
zh_hans: %1$lld 输入 · %2$lld 输出

# %lld input · %lld output tokens
source: %1$lld input · %2$lld output tokens
zh_hans: %1$lld 个输入 token · %2$lld 个输出 token

source: %lld items waiting
zh_hans: %lld 个项目正在等待

source: %lld mapping definitions
zh_hans: %lld 个映射定义

source: %lld matching requests
zh_hans: %lld 个匹配请求

# %lld models available from %@.
source: %1$lld models available from %2$@.
zh_hans: %2$@ 提供 %1$lld 个模型。

source: %lld models available. The list refreshes after local downloads.
zh_hans: 有 %lld 个模型可用。本地下载后会刷新列表。

source: %lld ms
zh_hans: %lld 毫秒

source: %lld muted sources
zh_hans: %lld 个已静音的来源

source: %lld nearby requests to this host also failed.
zh_hans: 向该主机发出的另外 %lld 个邻近请求也失败了。

source: %lld new
zh_hans: %lld 个新项目

source: %lld New Updates
zh_hans: %lld 个新更新

# %lld of %lld
source: %1$lld of %2$lld
zh_hans: %2$lld 个中的 %1$lld 个

# %lld of %lld batch calls failed
source: %1$lld of %2$lld batch calls failed
zh_hans: %2$lld 个批量调用中有 %1$lld 个失败

# %lld of %lld complete
source: %1$lld of %2$lld complete
zh_hans: 已完成 %2$lld 个中的 %1$lld 个

# %lld of %lld entries
source: %1$lld of %2$lld entries
zh_hans: 第 %1$lld 个，共 %2$lld 个条目

# %lld of %lld events
source: %1$lld of %2$lld events
zh_hans: %2$lld 个事件中的 %1$lld 个

# %lld of %lld Projects
source: %1$lld of %2$lld Projects
zh_hans: 第 %1$lld 个，共 %2$lld 个项目

# %lld of %lld requests
source: %1$lld of %2$lld requests
zh_hans: %2$lld 个请求中的 %1$lld 个

# %lld of %lld rules
source: %1$lld of %2$lld rules
zh_hans: 第 %1$lld 条，共 %2$lld 条规则

# %lld of %lld selected request(s)
source: %1$lld of %2$lld selected request(s)
zh_hans: 已选择 %2$lld 个请求中的 %1$lld 个

source: %lld overlaps; Tunnel Without Decryption takes priority
zh_hans: %lld 处重叠；“不解密隧道”优先

source: %lld paused items will receive a 503 Service Unavailable response.
zh_hans: %lld 个暂停的项目将收到 503 Service Unavailable 响应。

source: %lld plugins
zh_hans: %lld 个插件

source: %lld removed
zh_hans: 已移除 %lld 个

# %lld request tabs · %lld response tabs
source: %1$lld request tabs · %2$lld response tabs
zh_hans: %1$lld 个请求标签页 · %2$lld 个响应标签页

source: %lld requests
zh_hans: %lld 个请求

source: %lld requests are showing with the current filters
zh_hans: 当前筛选器下显示 %lld 个请求

source: %lld RPC errors
zh_hans: %lld 个 RPC 错误

source: %lld rules
zh_hans: %lld 条规则

source: %lld saved
zh_hans: 已保存 %lld 个

source: %lld schemas
zh_hans: %lld 个架构

source: %lld seconds
zh_hans: %lld 秒

source: %lld selected request(s)
zh_hans: %lld 个所选请求

source: %lld selected requests
zh_hans: %lld 个选定的请求

# %lld selected, %lld of %lld shown
source: %1$lld selected, %2$lld of %3$lld shown
zh_hans: 已选择 %1$lld 个，显示 %2$lld / %3$lld

source: %lld shown
zh_hans: 已显示 %lld 个

# %lld similar requests in %@
source: %1$lld similar requests in %2$@
zh_hans: %2$@ 中有 %1$lld 个相似请求

source: %lld Spaces
zh_hans: %lld 个空格

source: %lld suggested
zh_hans: 建议 %lld 个

source: %lld templates
zh_hans: %lld 个模板

source: %lld versions behind
zh_hans: 落后 %lld 个版本

source: %lld Web3 methods
zh_hans: %lld 个 Web3 方法

# %lld/%lld rows selected
source: %1$lld/%2$lld rows selected
zh_hans: 已选择 %1$lld/%2$lld 行

source: %lldm
zh_hans: %lld分钟

# %lldm %llds remaining
source: %1$lldm %2$llds remaining
zh_hans: 剩余 %1$lldm %2$llds

source: ^[%lld file](inflect: true)
zh_hans: ^[%lld 个文件](inflect: true)

source: ^[%lld frame](inflect: true)
zh_hans: ^[%lld 帧](inflect: true)

source: ^[%lld host](inflect: true)
zh_hans: ^[%lld 个主机](inflect: true)

source: ^[%lld line change](inflect: true)
zh_hans: ^[%lld 行更改](inflect: true)

source: ^[%lld log entry](inflect: true)
zh_hans: ^[%lld 条日志](inflect: true)

source: ^[%lld op](inflect: true)
zh_hans: ^[%lld 次操作](inflect: true)

source: ^[%lld request](inflect: true)
zh_hans: ^[%lld 个请求](inflect: true)

source: ^[%lld request](inflect: true) can't be inferred and will be skipped
zh_hans: ^[%lld 个请求](inflect: true) 无法推断，将被跳过

source: ^[%lld request](inflect: true) selected
zh_hans: 已选择 ^[%lld 个请求](inflect: true)

source: ^[%lld Traffic Tab](inflect: true)
zh_hans: ^[%lld 个流量标签页](inflect: true)

source: ^[%lld transaction file](inflect: true)
zh_hans: ^[%lld 个事务文件](inflect: true)

source: ^[%lld transaction](inflect: true)
zh_hans: ^[%lld 个事务](inflect: true)

source: <Missing URL>
zh_hans: <缺少 URL>

source: <redacted before saving>
zh_hans: <保存前已脱敏>

source: ⌘. Cancel
zh_hans: ⌘. 取消

source: ⌘↩ Send
zh_hans: ⌘↩ 发送

source: 0 (No Timeout)
zh_hans: 0（无超时）

source: 1 active Breakpoint rule. Open Breakpoint Rules.
zh_hans: 有 1 条生效的断点规则。打开断点规则。

source: 1 active Map Local rule. Open Map Local.
zh_hans: 有 1 条生效的 Map Local 规则。打开 Map Local。

source: 1 active Map Remote rule. Open Map Remote.
zh_hans: 有 1 条生效的 Map Remote 规则。打开 Map Remote。

source: 1 condition
zh_hans: 1 个条件

source: 1 definition
zh_hans: 1 个定义

source: 1 ENABLED
zh_hans: 已启用 1 个

source: 1 host pattern
zh_hans: 1 个主机模式

source: 1 item waiting
zh_hans: 1 个项目正在等待

source: 1 mapping definition
zh_hans: 1 个映射定义

source: 1 matching request
zh_hans: 1 个匹配请求

source: 1 model available from %@.
zh_hans: %@ 提供 1 个可用模型。

source: 1 model available. The list refreshes after local downloads.
zh_hans: 有 1 个模型可用。本地下载完成后列表会刷新。

source: 1 muted source
zh_hans: 1 个已静音来源

source: 1 New Update
zh_hans: 1 个新更新

source: 1 request is showing with the current filters
zh_hans: 当前筛选条件下显示 1 个请求

source: 1 schema
zh_hans: 1 个架构

source: 1 version behind
zh_hans: 落后 1 个版本

source: 1–%lld characters. Names must be unique.
zh_hans: 1–%lld 个字符。名称必须唯一。

source: 1. Local Model Setup
zh_hans: 1. 本地模型设置

source: 1. Open your favorite Terminal app
zh_hans: 1. 打开你常用的终端应用

source: 2 compared requests
zh_hans: 2 个已比较的请求

source: 2. Copy and paste this command into that terminal
zh_hans: 2. 将此命令复制并粘贴到该终端中

source: 2. Provider & Model
zh_hans: 2. 提供商与模型

source: 3. Connection
zh_hans: 3. 连接

source: 3. Run %@ in that terminal session
zh_hans: 3. 在该终端会话中运行 %@

source: 5-byte gRPC prefix visible
zh_hans: 可见 5 字节的 gRPC 前缀

source: 15 seconds
zh_hans: 15 秒

source: 30 seconds
zh_hans: 30 秒

source: 60 seconds
zh_hans: 60 秒

source: A bare domain also covers its subdomains. Use *.domain.com when only subdomains should match.
zh_hans: 裸域名也涵盖其子域名。仅需匹配子域名时，请使用 *.domain.com。

source: A credential signal was present, but captured traffic cannot verify its validity or server-side policy.
zh_hans: 检测到凭据信号，但捕获的流量无法验证其有效性或服务器端策略。

source: A credential signal was present, but the server did not authenticate it.
zh_hans: 检测到凭据，但服务器未对其进行身份验证。

source: A Mock API script runs on Request and replaces the response.
zh_hans: Mock API 脚本在请求阶段运行并替换响应。

source: A new version of Rockxy is available
zh_hans: Rockxy 有新版本可用

source: A new version of Rockxy is available.
zh_hans: Rockxy 有新版本可用。

source: A newer helper version is bundled with this app.
zh_hans: 此 App 捆绑了更新版本的辅助工具。

source: A P-256 elliptic curve root certificate will be created locally on this machine.
zh_hans: 将在本机创建 P-256 椭圆曲线根证书。

source: A Project can contain up to %lld Traffic Tabs in this build.
zh_hans: 在此版本中，一个项目最多可包含 %lld 个流量标签页。

source: A Project with this name already exists.
zh_hans: 已存在同名的项目。

source: A request must match every condition you set. Empty fields match any value.
zh_hans: 请求必须匹配你设置的每个条件。空字段可匹配任意值。

source: A root certificate is available for your client configuration.
zh_hans: 已有根证书可用于客户端配置。

source: A rule affected this request
zh_hans: 一条规则影响了此请求

source: A rule with this host pattern and behavior already exists.
zh_hans: 已存在具有此主机模式和行为的规则。

source: A Traffic Tab contains an invalid name or filter configuration. Rename or simplify that tab, then try again.
zh_hans: 某个 Traffic Tab 的名称或筛选配置无效。请重命名或简化该标签页后重试。

source: Abort all paused traffic?
zh_hans: 中止所有暂停的流量？

source: Abort All with 503
zh_hans: 全部以 503 中止

source: Abort with 503
zh_hans: 以 503 中止

source: About
zh_hans: 关于

source: About %@
zh_hans: 关于 %@

# About %lld%% slower than the session median of %@.
source: About %1$lld%% slower than the session median of %2$@.
zh_hans: 比会话中位数 %2$@ 慢约 %1$lld%%。

source: About MCP
zh_hans: 关于 MCP

source: About Rockxy
zh_hans: 关于 Rockxy

source: Accept and Add iOS Workspace
zh_hans: 接受并添加 iOS 工作区

source: Access
zh_hans: 访问

source: Access & Help
zh_hans: 访问与帮助

source: Account
zh_hans: 账户

source: Action
zh_hans: 操作

source: Action type
zh_hans: 操作类型

source: Actions
zh_hans: 操作

source: Actions stay under your control
zh_hans: 操作始终由你掌控

source: Active
zh_hans: 活跃

source: ACTIVE
zh_hans: 活跃

source: Active mutation rules
zh_hans: 活跃的修改规则

source: Active Project
zh_hans: 当前项目

source: Active Project: %@
zh_hans: 当前项目：%@

source: Adapter Capabilities
zh_hans: 适配器功能

source: Adapter pending for %@
zh_hans: %@ 的适配器待完成

source: Add
zh_hans: 添加

source: Add %lld
zh_hans: 添加 %lld

source: Add a compound filter rule
zh_hans: 添加复合过滤规则

source: Add a header name, or capture some traffic to see suggested headers here.
zh_hans: 添加标头名称，或捕获一些流量以在此查看建议的标头。

source: Add a host pattern above or choose the local-network presets.
zh_hans: 在上方添加主机模式，或选择本地网络预设。

source: Add a host pattern or observed domains to decrypt their HTTPS.
zh_hans: 添加主机模式或已观测到的域名，以解密其 HTTPS。

source: Add a note about this request…
zh_hans: 添加关于此请求的备注…

source: Add an include or exclude condition to preview matches
zh_hans: 添加包含或排除条件以预览匹配项

source: Add As Column
zh_hans: 添加为列

source: Add at least one destination override before saving.
zh_hans: 保存前，请至少添加一个目标覆盖项。

source: Add at least one destination override.
zh_hans: 请至少添加一个目标覆盖项。

source: Add Breakpoint Rule
zh_hans: 添加断点规则

source: Add CORS Headers
zh_hans: 添加 CORS 标头

source: Add Custom Certificates…
zh_hans: 添加自定义证书…

source: Add favorite app or domain
zh_hans: 添加常用应用或域名

source: Add Filter
zh_hans: 添加过滤器

source: Add Header
zh_hans: 添加标头

source: Add Header Column
zh_hans: 添加标头列
